- This notebook is extension of [`1.0_PREPROCESSING.ipynb`](./1.0_PREPROCESSING.ipynb) notebook.
- I am doing extra preprocessing on top of [`1.0_PRPROCESSING.csv`](../../data/processed/1.0_CLEANING_houses.csv).

In [2]:
from ast import literal_eval

import pandas as pd
import numpy as np

In [20]:
pd.set_option('display.max_columns', None)

In [3]:
df = pd.read_csv('data/processed/houses.csv')
print(df.shape)
df.head(3)

(1034, 26)

,property_name,link,society,price,rate,area,bedRoom,bathroom,balcony,totalFloors,...,plot_area,built_up_area,carpet_area,study room,servant room,store room,pooja room,others,sector,furnish_type
0,5 bedroom house for sale in sector 70a gurgaon,https://www.99acres.com/5-bhk-bedroom-independ...,bptp visionnaire,525.0,20115.0,2603.92,5.0,4.0,-1.0,3.0,...,290.0,NaN,NaN,0,1,0,0,0,sector 70a,0
1,5 bedroom house for sale in sector 21a faridabad,https://www.99acres.com/5-bhk-bedroom-independ...,NaN,570.0,105751.0,538.00,5.0,4.0,2.0,2.0,...,539.0,NaN,NaN,0,1,1,1,0,sector 21a,0
2,10 bedroom house for sale in sushant lok phase 1,https://www.99acres.com/10-bhk-bedroom-indepen...,NaN,210.0,38251.0,548.76,10.0,10.0,-1.0,5.0,...,61.0,NaN,NaN,0,1,0,0,0,sector 43,0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1034 entries, 0 to 1033
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   property_name    1034 non-null   object
 1   link             1034 non-null   object
 2   society          453 non-null    object
 3   price            958 non-null    float64
 4   rate             1005 non-null   float64
 5   area             1034 non-null   float64
 6   bedRoom          977 non-null    float64
 7   bathroom         977 non-null    float64
 8   balcony          977 non-null    float64
 9   totalFloors      957 non-null    float64
 10  facing           673 non-null    object
 11  agePossession    1034 non-null   object
 12  nearbyLocations  1034 non-null   object
 13  description      1026 non-null   object
 14  features         674 non-null    object
 15  property_id      1026 non-null   object
 16  plot_area        779 non-null    float64
 17  built_up_area    291 non-null    float64
 18  carpet_area      184 non-null    float64
 19  study room       1034 non-null   int64
 20  servant room     1034 non-null   int64
 21  store room       1034 non-null   int64
 22  pooja room       1034 non-null   int64
 23  others           1034 non-null   int64
 24  sector           904 non-null    object
 25  furnish_type     1034 non-null   int64
dtypes: float64(10), int64(6), object(10)
memory usage: 210.2+ KB

In [5]:
df.isnull().sum()

property_name        0
link                 0
society            581
price               76
rate                29
area                 0
bedRoom             57
bathroom            57
balcony             57
totalFloors         77
facing             361
agePossession        0
nearbyLocations      0
description          8
features           360
property_id          8
plot_area          255
built_up_area      743
carpet_area        850
study room           0
servant room         0
store room           0
pooja room           0
others               0
sector             130
furnish_type         0
dtype: int64

## society

In [6]:
df['society'].nunique()

184

In [7]:
df['society'].unique()[:20]

array(['bptp visionnaire', nan, 'emaar mgf marbella',
       'luxury dlf city floors', 'sushant lok 1 builder floors',
       'dlf city plots phase 3', 'dlf city plots phase 2',
       'unitech espace', 'vipul tatvam villa',
       'ansal sushant lok plots4.1 â˜…', 'grover homes sec 4',
       'ansal api esencia3.7 â˜…', 'floor wise designer kothi',
       'suncity essel towers4.2 â˜…', 'sector 37', 'nul',
       'experion windchants3.8 â˜…', 'uppal southend4.0 â˜…',
       'dlf new town heights3.7 â˜…', 'dlf new town heights 24.0 â˜…'],
      dtype=object)

In [8]:
df['society'] = df['society'].str.replace(r'\d+\.?\d+\s?.', '', regex=True)
df['society'].nunique()

182

## rate >> price_per_sqft

In [9]:
df.rename(columns={'rate': 'price_per_sqft'}, inplace=True)

## price

In [10]:
null_price_df = df[df['price'].isnull()].copy()
print(null_price_df.shape)
null_price_df.head(3)

(76, 26)

,property_name,link,society,price,price_per_sqft,area,bedRoom,bathroom,balcony,totalFloors,...,plot_area,built_up_area,carpet_area,study room,servant room,store room,pooja room,others,sector,furnish_type
47,5 bedroom house for sale in sector 66 gurgaon,https://www.99acres.com/5-bhk-bedroom-independ...,emaar mgf marbella,NaN,NaN,3152.68,5.0,5.0,-1.0,3.0,...,350.0,NaN,NaN,1,1,0,1,0,sector 66,0
62,5 bedroom house for sale in sector 109 gurgaon,https://www.99acres.com/5-bhk-bedroom-independ...,international city by sobha phase 2,NaN,13622.0,7327.56,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,0,sector 109,0
63,4 bedroom house for sale in sector 109 gurgaon,https://www.99acres.com/4-bhk-bedroom-independ...,international city by sobha phase 2,NaN,13909.0,4217.92,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,0,sector 109,0

In [11]:
null_price_df.index

Index([  47,   62,   63,   66,   67,   68,   69,   70,   71,   72,   73,   74,
         75,   76,   77,   78,   81,   82,   83,   84,   85,   86,   87,   88,
         89,   92,   93,   94,   95,   96,   97,   98,   99,  100,  102,  103,
        104,  105,  110,  111,  115,  250,  271,  275,  276,  282,  288,  289,
        290,  291,  292,  295,  314,  315,  316,  317,  320,  321,  322,  366,
        430,  438,  455,  575,  721,  729,  758,  785,  793,  810,  834,  837,
        910,  993, 1013, 1014],
      dtype='int64')

In [12]:
null_price_df['price_per_sqft'].fillna(0, inplace=True)
null_price_df['area'].fillna(0, inplace=True)

In [13]:
null_price_df['price'] = (
    null_price_df['price_per_sqft'].mul(null_price_df['area']).div(1_00_000).round(2)
)

In [14]:
null_price_df['price'] = null_price_df['price'].apply(lambda x: np.nan if x == 0 else x)

In [15]:
df.loc[null_price_df.index, 'price'] = null_price_df['price']

In [16]:
df['price'].isnull().sum()

29

## plot_area, built_up_area, carpet_area

In [17]:
df[['area', 'plot_area', 'built_up_area', 'carpet_area']].sample(20)

        area  plot_area  built_up_area  carpet_area
415   430.40        NaN            NaN        435.0
412  1463.36     1460.0            NaN          NaN
359   602.56        NaN            NaN        600.0
298  1796.92      200.0            NaN          NaN
681   903.84      900.0            NaN          NaN
839  3238.76      360.0            NaN          NaN
831  3238.76      360.0            NaN          NaN
959   236.72      232.0            NaN          NaN
566   742.44      745.0          745.0          NaN
352  1796.92      200.0            NaN          NaN
199  1345.00      150.0            NaN          NaN
539  2840.64      316.0            NaN          NaN
663  8995.36     1000.0            NaN          NaN
679  6994.00     7000.0            NaN          NaN
801  7198.44      800.0            NaN          NaN
261  1495.64        NaN         1500.0          NaN
695  1345.00      150.0            NaN          NaN
943  1700.08     1700.0            NaN          NaN
302   451.92      450.0            NaN          NaN
678  2001.36     2000.0            NaN          NaN

In [21]:
df.loc[[585]]

,property_name,link,society,price,price_per_sqft,area,bedRoom,bathroom,balcony,totalFloors,facing,agePossession,nearbyLocations,description,features,property_id,plot_area,built_up_area,carpet_area,study room,servant room,store room,pooja room,others,sector,furnish_type
585,3 bedroom house for sale in golf course road,https://www.99acres.com/3-bhk-bedroom-independ...,NaN,160.0,160000.0,96.84,3.0,2.0,2.0,41.0,NaN,Relatively New,"['sector 42-43 metro station', 'sector 53-54 m...",we have a house/villa available for sale in go...,NaN,g66408912,100.0,NaN,NaN,0,0,0,0,0,NaN,0